Revit 2027 API
MEPSection.GetElementIds Method
 Gets all element ids that are contained in the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetElementIds()
Public Function GetElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetElementIds()
member GetElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace